---
layout: post
published: false
title: VIVO Apps and Tools Webinar
tags:
 - vivo
 - oai-pmh
 - lattes
---

#+startup: showall 
#+PROPERTY: cache yes
#+PROPERTY: results output
#+PROPERTY: session *R*
#+PROPERTY: cache yes
#+OPTIONS: toc:nil
#+PROPERTY: exports code

* Introduction

I am here continuing my last post where I have started to write about
the webinar that I presented to the VIVO Apps and Tools Group.

* Working with OAI-PMH

As I wrote in the last post, metadata about thesis and working papers
are collected from FGV Digital Library that runs Dspace. DSpace
[[https://wiki.duraspace.org/display/DSDOC4x/OAI][implements]] the [[http://www.openarchives.org][OAI-PMH protocol]], which makes the crawler of data much
easier.

- http://re.cs.uct.ac.za
- http://cran.r-project.org/web/packages/OAIHarvester/index.html
- https://pypi.python.org/pypi/pyoai/2.4.4

** Repository Exploring

#+BEGIN_SRC R :results table :cache yes
library(OAIHarvester)
baseurl <- "http://bibliotecadigital.fgv.br/oai/request"
oaih_list_metadata_formats(baseurl)
#+END_SRC

#+RESULTS[dd4722f705f05eb68c2467507e4b544b27d4a687]:
| oai_dc | http://www.openarchives.org/OAI/2.0/oai_dc.xsd              | http://www.openarchives.org/OAI/2.0/oai_dc/ |
| rdf    | http://www.openarchives.org/OAI/2.0/rdf.xsd                 | http://www.openarchives.org/OAI/2.0/rdf/    |
| ore    | http://tweety.lanl.gov/public/schemas/2008-06/atom-tron.sch | http://www.w3.org/2005/Atom                 |
| mets   | http://www.loc.gov/standards/mets/mets.xsd                  | http://www.loc.gov/METS/                    |

#+name: sets
#+BEGIN_SRC R :cache yes
sets <- oaih_list_sets(baseurl)
head(sets)
#+END_SRC

#+RESULTS[88f5fc9bb6b8b770ab93863c18bf4730121309ad]: sets
| hdl_10438_6904 | Cadernos FGV Projetos                                                            | list() |
| hdl_10438_4132 | CPDOC - Artigos, Livros, Papers                                                  | list() |
| hdl_10438_2692 | CPDOC - Dissertações, Mestrado em História, Política e Bens Culturais            | list() |
| hdl_10438_1758 | CPDOC - Dissertações, Mestrado Profissional em Bens Culturais e Projetos Sociais | list() |
| hdl_10438_4164 | CPDOC Relações Internacionais - Artigos e papers                                 | list() |
| hdl_10438_4168 | CPDOC Relações Internacionais -Teses e Dissertações                              | list() |

#+BEGIN_SRC R :var series=sets :results output
records <- oaih_list_records(baseurl, set = series[3,1])
dim(records)
colnames(records)
#+END_SRC

#+RESULTS[3587dddb293079161648e2c7e98cd2fa565669ab]:
: [1] 31  5
: [1] "identifier" "datestamp"  "setSpec"    "metadata"   "about"

#+BEGIN_SRC R :results output
records[1,"metadata"]
#+END_SRC

#+RESULTS[7bb006f3d1b1a99e16a30bc162146090c066c046]:
#+begin_example
$metadata
<oai_dc:dc schemaLocation="http://www.openarchives.org/OAI/2.0/oai_dc/ http://www.openarchives.org/OAI/2.0/oai_dc.xsd" xmlns:oai_dc="http://www.openarchives.org/OAI/2.0/oai_dc/" xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <dc:title>Por que é cidadão o jornalista-cidadão? História das mídias e jornalismo cidadão de base comunitária na Maré</dc:title>
 <dc:creator>Chagas, Viktor Henrique Carneiro de Souza</dc:creator>
 <dc:description>Afinal, por que é cidadão o jornalista cidadão? Foi esta a pergunta que desencadeou
todo um esforço de pesquisa no sentido de identificar práticas comuns nas diferentes
experiências de jornalismo cidadão. Para desenvolver e tentar ampliar o conceito
trabalhado, a opção foi de analisar o espectro da comunicação comunitária, sobretudo
em veículos que tiveram origem na área da Maré, no Rio de Janeiro, nas últimas três
décadas. Assim, mapeando algumas dessas experiências e selecionando casos entre os
que chamaram mais atenção pela propriedade com que trabalham os aspectos
relacionados ao jornalismo cidadão, esta dissertação se detém sobre o significado da
cidadania para o cidadão-jornalista e a contribuição à identidade local prestada pela
comunicação comunitária. Minha idéia é demonstrar como experiências deste gênero
são capazes de não apenas de pautar meios tradicionais de mídia, mas sobretudo de
ajudar a estabelecer dentro da própria comunidade uma cultura de mídia e uma esfera
pública local, desenvolvendo uma reapropriação da identidade da favela e de seus
moradores e contribuindo para a busca e/ou exercício da cidadania.</dc:description>
 <dc:contributor>Hollanda, Bernardo Borges Buarque de</dc:contributor>
 <dc:contributor>Albuquerque, Afonso de</dc:contributor>
 <dc:contributor>Aldé, Alessandra</dc:contributor>
 <dc:contributor>Miguel, Luis Felipe</dc:contributor>
 <dc:contributor>Lattman-Weltman, Fernando</dc:contributor>
 <dc:date>2009-06-17T19:02:36Z</dc:date>
 <dc:date>2009-06-17T19:02:36Z</dc:date>
 <dc:date>2009-03-06</dc:date>
 <dc:type>Dissertation</dc:type>
 <dc:identifier>http://hdl.handle.net/10438/2676</dc:identifier>
 <dc:language>pt_BR</dc:language>
</oai_dc:dc>
#+end_example

** Current Workflow

- shell script 
 - python script getdata.py
 - XSLT transformation over dc metadata records
- show files
 
** Future directions

- CL package for OAI-PMH (forget Python!)
- retrieve using mets instead of dc
- see http://bibliotecadigital.fgv.br/dspace/handle/10438/11552?show=full

#+BEGIN_SRC R :results output
r1 <- oaih_list_records(baseurl, prefix = "mets", set = series[3,1])
r1[1,"metadata"]
#+END_SRC

#+RESULTS[2b0c923b80d32bd434a90e31c0580bec9cd4e367]:
#+begin_example
$metadata
<mets OBJID="hdl:10438/2676" LABEL="DSpace Item" schemaLocation="http://www.loc.gov/METS/ http://www.loc.gov/standards/mets/mets.xsd http://www.loc.gov/mods/v3 http://www.loc.gov/standards/mods/v3/mods-3-0.xsd" xmlns="http://www.loc.gov/METS/" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:mods="http://www.loc.gov/mods/v3">
 <metsHdr CREATEDATE="2014-04-29T08:02:23">
  <agent ROLE="CUSTODIAN" TYPE="ORGANIZATION">
   <name>DSpace@FGV</name>
  </agent>
 </metsHdr>
 <dmdSec ID="DMD_hdl_10438/2676">
  <mdWrap MDTYPE="MODS">
   <xmlData>
    <mods:name>
     <mods:role>
      <mods:roleTerm type="text">advisor</mods:roleTerm>
     </mods:role>
     <mods:namePart>Lattman-Weltman, Fernando</mods:namePart>
    </mods:name>
    <mods:name>
     <mods:role>
      <mods:roleTerm type="text">author</mods:roleTerm>
     </mods:role>
     <mods:namePart>Chagas, Viktor Henrique Carneiro de Souza</mods:namePart>
    </mods:name>
    <mods:name>
     <mods:role>
      <mods:roleTerm type="text">other</mods:roleTerm>
     </mods:role>
     <mods:namePart>Hollanda, Bernardo Borges Buarque de</mods:namePart>
    </mods:name>
    <mods:name>
     <mods:role>
      <mods:roleTerm type="text">other</mods:roleTerm>
     </mods:role>
     <mods:namePart>Albuquerque, Afonso de</mods:namePart>
    </mods:name>
    <mods:name>
     <mods:role>
      <mods:roleTerm type="text">other</mods:roleTerm>
     </mods:role>
     <mods:namePart>Aldé, Alessandra</mods:namePart>
    </mods:name>
    <mods:name>
     <mods:role>
      <mods:roleTerm type="text">other</mods:roleTerm>
     </mods:role>
     <mods:namePart>Miguel, Luis Felipe</mods:namePart>
    </mods:name>
    <mods:extension>
     <mods:dateAccessioned encoding="iso8601">2009-06-17T19:02:36Z</mods:dateAccessioned>
    </mods:extension>
    <mods:extension>
     <mods:dateAvailable encoding="iso8601">2009-06-17T19:02:36Z</mods:dateAvailable>
    </mods:extension>
    <mods:originInfo>
     <mods:dateIssued encoding="iso8601">2009-03-06</mods:dateIssued>
    </mods:originInfo>
    <mods:identifier type="uri">http://hdl.handle.net/10438/2676</mods:identifier>
    <mods:abstract>Afinal, por que é cidadão o jornalista cidadão? Foi esta a pergunta que desencadeou
todo um esforço de pesquisa no sentido de identificar práticas comuns nas diferentes
experiências de jornalismo cidadão. Para desenvolver e tentar ampliar o conceito
trabalhado, a opção foi de analisar o espectro da comunicação comunitária, sobretudo
em veículos que tiveram origem na área da Maré, no Rio de Janeiro, nas últimas três
décadas. Assim, mapeando algumas dessas experiências e selecionando casos entre os
que chamaram mais atenção pela propriedade com que trabalham os aspectos
relacionados ao jornalismo cidadão, esta dissertação se detém sobre o significado da
cidadania para o cidadão-jornalista e a contribuição à identidade local prestada pela
comunicação comunitária. Minha idéia é demonstrar como experiências deste gênero
são capazes de não apenas de pautar meios tradicionais de mídia, mas sobretudo de
ajudar a estabelecer dentro da própria comunidade uma cultura de mídia e uma esfera
pública local, desenvolvendo uma reapropriação da identidade da favela e de seus
moradores e contribuindo para a busca e/ou exercício da cidadania.</mods:abstract>
    <mods:language>
     <mods:languageTerm authority="rfc3066">pt_BR</mods:languageTerm>
    </mods:language>
    <mods:titleInfo>Por que é cidadão o jornalista-cidadão? História das mídias e jornalismo cidadão de base comunitária na Maré</mods:titleInfo>
    <mods:genre>Dissertation</mods:genre>
   </xmlData>
  </mdWrap>
 </dmdSec>
 <amdSec ID="TMD_hdl_10438/2676">
  <rightsMD>
   <mdWrap MIMETYPE="text/plain" MDTYPE="OTHER" OTHERMDTYPE="TEXT">
    <binData>TGljZW5z...</binData>
   </mdWrap>
  </rightsMD>
 </amdSec>
 <fileSec>
  <fileGrp USE="ORIGINAL">
   <file ID="10438_2676_1" MIMETYPE="application/pdf" SIZE="2326531" CHECKSUM="6b19a1b5f0a14e36ccd4e92a04f821c7" CHECKSUMTYPE="MD5" OWNERID="http://bibliotecadigital.fgv.br/dspace/bitstream/10438/2676/1/CPDOC2009ViktorHenriqueCarneirodeSouzaChagas.pdf" GROUPID="GROUP_10438_2676_1">
    <FLocat LOCTYPE="URL" type="simple" href="http://bibliotecadigital.fgv.br/dspace/bitstream/10438/2676/1/CPDOC2009ViktorHenriqueCarneirodeSouzaChagas.pdf"/>
   </file>
  </fileGrp>
  <fileGrp USE="TEXT">
   <file ID="10438_2676_3" MIMETYPE="text/plain" SIZE="594220" CHECKSUM="4fd22d612ed02fcc711dd31e554d72d8" CHECKSUMTYPE="MD5" OWNERID="http://bibliotecadigital.fgv.br/dspace/bitstream/10438/2676/3/CPDOC2009ViktorHenriqueCarneirodeSouzaChagas.pdf.txt" GROUPID="GROUP_10438_2676_1">
    <FLocat LOCTYPE="URL" type="simple" href="http://bibliotecadigital.fgv.br/dspace/bitstream/10438/2676/3/CPDOC2009ViktorHenriqueCarneirodeSouzaChagas.pdf.txt"/>
   </file>
  </fileGrp>
  <fileGrp USE="THUMBNAIL">
   <file ID="10438_2676_4" MIMETYPE="image/jpeg" SIZE="14717" CHECKSUM="a04473733661de3408752512dc6f5743" CHECKSUMTYPE="MD5" OWNERID="http://bibliotecadigital.fgv.br/dspace/bitstream/10438/2676/4/CPDOC2009ViktorHenriqueCarneirodeSouzaChagas.pdf.jpg" GROUPID="GROUP_10438_2676_1">
    <FLocat LOCTYPE="URL" type="simple" href="http://bibliotecadigital.fgv.br/dspace/bitstream/10438/2676/4/CPDOC2009ViktorHenriqueCarneirodeSouzaChagas.pdf.jpg"/>
   </file>
  </fileGrp>
 </fileSec>
 <structMap>
  <div/>
 </structMap>
</mets>
#+end_example

